#include<iostream>
#include <locale>
#include <windows.h>
#include <cmath>
#include <ctime> // Бібліотека для rand (генератора випадкових чисел)
using namespace std; // Щоб не писати кожен раз перед cout


int main() {//Початок програми
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // Разработать программу, которая выводит на экран горизонтальную линию из символов. Число символов, какой
    // использовать символ, и какая будет линия — вертикальная, или горизонтальная — указывает пользователь.

    //int Line = 0; // Кількість символів
    //int Rozmischenya = 0; // Розміщення 1-горизонтальне, 2-вертикальне
    //char Symbol; // З якого символа має будуватись лінія
    //cout << "Вводимо кількість символів в лінії: ";
    //cin >> Line;
    //cout << "Вибираємо розміщення лінії горизонтальне чи вертикальне (для цього нажимаємо 1 або 2): ";
    //cin >> Rozmischenya;
    //cout << "Вибираємо символ лінії, з якої він має будуватись: ";
    //cin >> Symbol;
    //int i = 0;
    //
	//while (i < Line)
	//{
	//	if (Rozmischenya == 1)
	//	{
	//		cout << Symbol;
	//	}
	//	else if (Rozmischenya == 2)
	//	{
	//		cout << Symbol << endl;
	//	}
	//	i++;
	//}

    //Написать программу, которая находит сумму всех целых нечетных чисел в диапазоне, указанном пользователе.
   
    //int Start, Finish; // Початок та кінець діапазону
    //int i = 0;
    //int Suma = 0;
    //cout << "Вводимо початок діапазону: " << endl;
    //cin >> Start;
    //cout << "Вводимо кінець діапазону: " << endl;
    //cin >> Finish;
    //cout << "Виводимо суму всіх непарних чисел діапазону від " << Start << " до " << Finish << endl;
    //i = Start-1;
    //while (i < Finish)
    //{
    //    i++;
    //    if (i%2==1 || i % 2 == -1)
    //    {
    //        Suma += i;
    //    }
	//}
	//cout << "Сума непарних чисел даного діапазону становить: " << Suma << endl;
	//if (Start > Finish)
	//{
	//	cout << "Діапазон чисел введено не вірно!!!" << endl;
	//}

    // Дано натуральное число n. Написать программу, которая вычисляет факториал неотрицательных целых чисел n(т.е.число целое и больше 0).
    
    //int N = 0;
    //int i = 1;
    //int DobutokN = 1;
    //cout << "Вводимо ціле невідємне число: ";
    //cin >> N;
    //cout << "Визначаємо факторіал числа " << N <<  endl;
    //
    //while (i < N)
    //{
    //    i++;
    //    if (N>0)
    //    {
    //        DobutokN *= i;
    //    }
    //    else if (N==0)
    //    {
    //        DobutokN *= i + 1;
    //    }
	//}
    //if (N>=0)
    //{
    //    cout << "Факторіал числа " << N << " дорівнює: " << DobutokN << endl;
    //}
    //else
    //{
    //    cout << "Невірно введене число!";
    //}
   
    // 112.Написать программу, которая выводит на экран ваше имя 10 раз.
    
    //int Name = 0;
    //     
    //cout << "Яку кількість разів потрібно вивести своє ім’я? => ";
    //cin >> Name;
    //
    //for (int i = 0; i < Name; i++)
    //{
    //    cout << i + 1 << ". " << "Yura" << endl;
    //}

    // 114. Написать программу, которая выводит таблицу квадратов первых десяти целых положительных чисел. Ниже приведен рекомендуемый вид экрана программы.
      
    //int Number = 0;
    //int Kvadrat;
    //cout << "Виводимо квадрати чисел від 1 до ";
    //cin >> Number;
    //for (int i = 1; i <= Number; i++)
    //{
    //    Kvadrat = i*i;
    //    cout << i  << "."<< " Квадрат числа " << i <<" = " << Kvadrat << endl;
    //}

    // 115.  Написать программу, которая выводит таблицу квадратов первых пяти целых положительных нечетных чисел.Ниже приведен рекомендуемый вид экрана программы.

        //int Number = 10;
        //int Kvadrat;
        //cout << "Таблиця квадратів непарних чисел." << endl;
        //cout << "--------------------------------" << endl;
        //cout << "\tЧисло\tКвадрат" << endl;
        //cout << "--------------------------------" << endl;
        //        
        //for (int i = 0; i < Number; i++)
        //{
        //    Kvadrat = i * i;
        //    if (i%2==1)
        //    {
        //        cout << "\t  " <<  i << "\t  " <<  Kvadrat << endl;
        //    }
        //}
        //cout << "--------------------------------" << endl;

    // 119. Написать программу, которая выводит на экран таблицу перевода длины из дюймов в миллиметры (1 дюйм = 2,54 см). 
    // Диапазон длины в дюймах и шаг изменения должны вводиться во время работы программы.
    
        //float Start, Finish = 0; // Початок та кінець діапазону в дюймах та крок діапазону
        //float Krok = 0;  // Крок діапазону
        //const float Dyuim_Sm = 2.54;
        //float Milimetru; //Змінна буде переводити дюйми в міліметри
        //                
        //cout << "Вводимо початок діапазону в дюймах: ";
        //cin >> Start;
        //cout << "Вводимо кінець діапазону в дюймах: ";
        //cin >> Finish;
        //cout << "Вводимо крок діапазону: ";
        //cin >> Krok;
        //
        //
        //for (float i = Start; i <= Finish; i += Krok)
        //{            
        //    Milimetru = i * Dyuim_Sm * 10;
        //    cout << i  << " дюйм " << "= " << Milimetru << "мм." << endl;
        //}

    // 121.  Написать программу, которая вычисляет сумму первых n целых положительных четных чисел. Количество суммируемых
    // чисел должно вводиться во время работы программы. Ниже приведен рекомендуемый вид экрана программы(данные, введенные пользователем, выделены полужирным).
    
    //int Number = 0;
    //int Suma = 0;
    //cout << "Вираховуємо суму парних додатніх чисел." << endl;
    //cout << "Вводимо кількість чисел, які маємо додати і нажимаємо <Enter>: ";
    //cin >> Number;
    //Number = Number * 2;
	//int i = 0;
    //
	//while (i < Number)
	//{
	//	if (i % 2 == 0)
	//	{
	//		i = i + 2;
	//		Suma += i;
	//	}
	//}
	//cout << "Сума перших " << Number / 2 << " додатніх парних чисел дорівнює: " << Suma;

    //Зробити програму для перевірки таблиці множення. Кількість питань для перевірки знань таблиці множення має бути 12. Кожне питаня має бути рандомним.
    

    srand(time(0)); //ініціалізація рандома - поточним часом, коли запустили програму
    int a = (rand() % 8) + 2, b = (rand() % 8) + 2; // генерування випадкових чисел від 2 до 9
	int res = a * b;
    int x = 0; // лічильник на вірні відповіді
    int y = 0; // лічильник на невірні відповіді
    int N = 55; // Кількість прикладів
    
	cout << "Перевірка таблиці множення." << endl;
    cout << "Дай відповідь на " << N << " прикладів." << endl;
    cout << "Після введення відповіді натисніть <Enter>." << endl;
        
    for (int i = 0; i < N; i++)
    {
        int a = (rand() % 8) + 2, b = (rand() % 8) + 2; // генерування випадкових чисел від 2 до 9
		cout << i + 1 << "." << " Скільки буде: " << a << " * " << b << " = ";
		cin >> res;
        if (res == (a * b))
		{
			x = x + 1;
		}
        else if (res != (a * b))
        {
            y = y + 1;
        }
    
	}
	cout <<  endl;
	cout << "У вас вірних відповідей " << x << " з " << N << " прикладів!" <<  endl;
	cout << "У вас невірних відповідей: " << y << " з " << N << " прикладів!" << endl;
    cout << "Ваша оцінка: " << x << endl;

    // Задача про переворот числа
    
    //int Number, Sum;
    //cout << "Вводимо число: ";
    //cin >> Number;
    //cout << "Ваше число навпаки: ";
    //
    //while (Number > 0)
    //{
    //    Sum = Number % 10;
    //    Number /= 10;
    //    cout << Sum;
    //}
          
    return 0; //Кінець програми
}
